## plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray
module.complete.data.http.my_public_ip: Reading...
module.complete.data.http.my_public_ip: Read complete after 1s [id=https://ifconfig.co/json]
module.complete.data.aws_ami_ids.sfos: Reading...
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
module.complete.data.aws_availability_zones.available: Reading...
module.complete.data.aws_caller_identity.current: Reading...
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
module.complete.data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
module.complete.data.aws_ami_ids.sfos: Read complete after 0s [id=1726762986]
module.complete.data.aws_ami.sfos["ami-07128c33c1fd3c1b7"]: Reading...
module.complete.data.aws_ami.sfos["ami-09aa82aa6bd7b2898"]: Reading...
module.complete.data.aws_ami.sfos["ami-009b8414a895bf268"]: Reading...
module.complete.data.aws_ami.sfos["ami-0033fea95a32aec73"]: Reading...
module.complete.data.aws_ami.sfos["ami-00d8e1c53ff1affdd"]: Reading...
module.complete.data.aws_ami.sfos["ami-0144c9c3d7ecdc4e1"]: Reading...
module.complete.data.aws_ami.sfos["ami-06f322d838a91ece9"]: Reading...
module.complete.data.aws_ami.sfos["ami-0d6aecf5a5b35b738"]: Reading...
module.complete.data.aws_ami.sfos["ami-07e17c213766869ad"]: Reading...
module.complete.data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
module.complete.data.aws_ami.sfos["ami-0ee1e65920a367745"]: Reading...
module.complete.data.aws_ami.sfos["ami-00d8e1c53ff1affdd"]: Read complete after 0s [id=ami-00d8e1c53ff1affdd]
module.complete.data.aws_ami.sfos["ami-0048728f83aec9691"]: Reading...
module.complete.data.aws_ami.sfos["ami-0033fea95a32aec73"]: Read complete after 0s [id=ami-0033fea95a32aec73]
module.complete.data.aws_ami.sfos["ami-0f79f932bda1a5f6f"]: Reading...
module.complete.data.aws_ami.sfos["ami-09aa82aa6bd7b2898"]: Read complete after 0s [id=ami-09aa82aa6bd7b2898]
module.complete.data.aws_ami.sfos["ami-0fbc4481b22827e0e"]: Reading...
module.complete.data.aws_ami.sfos["ami-07e17c213766869ad"]: Read complete after 0s [id=ami-07e17c213766869ad]
module.complete.data.aws_ami.sfos["ami-011bd28c1954c8120"]: Reading...
module.complete.data.aws_ami.sfos["ami-06f322d838a91ece9"]: Read complete after 0s [id=ami-06f322d838a91ece9]
module.complete.data.aws_ami.sfos["ami-0632c781b7833031f"]: Reading...
module.complete.data.aws_ami.sfos["ami-0144c9c3d7ecdc4e1"]: Read complete after 0s [id=ami-0144c9c3d7ecdc4e1]
module.complete.data.aws_ami.sfos["ami-08fd2fe204c7bb9a5"]: Reading...
module.complete.data.aws_ami.sfos["ami-009b8414a895bf268"]: Read complete after 0s [id=ami-009b8414a895bf268]
module.complete.data.aws_ami.sfos["ami-0d6aecf5a5b35b738"]: Read complete after 0s [id=ami-0d6aecf5a5b35b738]
module.complete.data.aws_ami.sfos["ami-0ee1e65920a367745"]: Read complete after 0s [id=ami-0ee1e65920a367745]
module.complete.data.aws_ami.sfos["ami-07128c33c1fd3c1b7"]: Read complete after 0s [id=ami-07128c33c1fd3c1b7]
module.complete.data.aws_ami.sfos["ami-0048728f83aec9691"]: Read complete after 0s [id=ami-0048728f83aec9691]
module.complete.data.aws_ami.sfos["ami-0fbc4481b22827e0e"]: Read complete after 0s [id=ami-0fbc4481b22827e0e]
module.complete.data.aws_ami.sfos["ami-011bd28c1954c8120"]: Read complete after 1s [id=ami-011bd28c1954c8120]
module.complete.data.aws_ami.sfos["ami-0632c781b7833031f"]: Read complete after 1s [id=ami-0632c781b7833031f]
module.complete.data.aws_ami.sfos["ami-08fd2fe204c7bb9a5"]: Read complete after 1s [id=ami-08fd2fe204c7bb9a5]
module.complete.data.aws_ami.sfos["ami-0f79f932bda1a5f6f"]: Read complete after 1s [id=ami-0f79f932bda1a5f6f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.complete.data.aws_iam_policy_document.ec2_iam_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_iam_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "secretsmanager:DescribeSecret",
+               "secretsmanager:GetSecretValue",
            ]
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
        }
    }

  # module.complete.data.aws_iam_policy_document.secure_storage_master_key will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "secure_storage_master_key" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "secretsmanager:DescribeSecret",
+               "secretsmanager:GetSecretValue",
            ]
+           resources = [
+               (known after apply),
            ]
        }
    }

  # module.complete.aws_iam_instance_profile.this will be created
+   resource "aws_iam_instance_profile" "this" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       path        = "/"
+       role        = (known after apply)
+       tags_all    = (known after apply)
+       unique_id   = (known after apply)
    }

  # module.complete.aws_iam_role.this will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.complete.aws_instance.this will be created
+   resource "aws_instance" "this" {
+       ami                                  = (known after apply)
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = false
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = (known after apply)
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = true
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = (known after apply)
+       tags_all                             = (known after apply)
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       launch_template {
+           id      = (known after apply)
+           name    = (known after apply)
+           version = "$Latest"
        }

+       maintenance_options {
+           auto_recovery = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_put_response_hop_limit = 1
+           http_tokens                 = "required"
+           instance_metadata_tags      = "enabled"
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_card_index    = (known after apply)
+           network_interface_id  = (known after apply)
        }

+       private_dns_name_options {
+           enable_resource_name_dns_a_record    = (known after apply)
+           enable_resource_name_dns_aaaa_record = (known after apply)
+           hostname_type                        = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }
    }

  # module.complete.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = (known after apply)
+       tags_all = (known after apply)
+       vpc_id   = (known after apply)
    }

  # module.complete.aws_launch_template.this will be created
+   resource "aws_launch_template" "this" {
+       arn             = (known after apply)
+       default_version = (known after apply)
+       id              = (known after apply)
+       image_id        = "ami-07e17c213766869ad"
+       instance_type   = "m5.large"
+       key_name        = "sophos"
+       latest_version  = (known after apply)
+       name            = (known after apply)
+       name_prefix     = (known after apply)
+       tags_all        = (known after apply)

+       block_device_mappings {
+           device_name = "/dev/xvda"

+           ebs {
+               delete_on_termination = "true"
+               encrypted             = "false"
+               iops                  = (known after apply)
+               throughput            = (known after apply)
+               volume_size           = 16
+               volume_type           = "gp2"
            }
        }
+       block_device_mappings {
+           device_name = "/dev/xvdg"

+           ebs {
+               delete_on_termination = "true"
+               encrypted             = "false"
+               iops                  = (known after apply)
+               throughput            = (known after apply)
+               volume_size           = 80
+               volume_type           = "gp2"
            }
        }

+       iam_instance_profile {
+           name = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = "disabled"
+           http_put_response_hop_limit = 1
+           http_tokens                 = "required"
+           instance_metadata_tags      = "enabled"
        }

+       network_interfaces {
+           device_index         = 0
+           network_interface_id = (known after apply)
        }
+       network_interfaces {
+           device_index         = 1
+           network_interface_id = (known after apply)
        }
    }

  # module.complete.aws_network_interface.private will be created
+   resource "aws_network_interface" "private" {
+       arn                       = (known after apply)
+       description               = "ENI for private subnet"
+       id                        = (known after apply)
+       interface_type            = (known after apply)
+       ipv4_prefix_count         = (known after apply)
+       ipv4_prefixes             = (known after apply)
+       ipv6_address_count        = (known after apply)
+       ipv6_address_list         = (known after apply)
+       ipv6_address_list_enabled = false
+       ipv6_addresses            = (known after apply)
+       ipv6_prefix_count         = (known after apply)
+       ipv6_prefixes             = (known after apply)
+       mac_address               = (known after apply)
+       outpost_arn               = (known after apply)
+       owner_id                  = (known after apply)
+       private_dns_name          = (known after apply)
+       private_ip                = (known after apply)
+       private_ip_list           = (known after apply)
+       private_ip_list_enabled   = false
+       private_ips               = (known after apply)
+       private_ips_count         = (known after apply)
+       security_groups           = (known after apply)
+       source_dest_check         = true
+       subnet_id                 = (known after apply)
+       tags                      = (known after apply)
+       tags_all                  = (known after apply)

+       attachment {
+           attachment_id = (known after apply)
+           device_index  = (known after apply)
+           instance      = (known after apply)
        }
    }

  # module.complete.aws_network_interface.public will be created
+   resource "aws_network_interface" "public" {
+       arn                       = (known after apply)
+       description               = "ENI for Public Subnet"
+       id                        = (known after apply)
+       interface_type            = (known after apply)
+       ipv4_prefix_count         = (known after apply)
+       ipv4_prefixes             = (known after apply)
+       ipv6_address_count        = (known after apply)
+       ipv6_address_list         = (known after apply)
+       ipv6_address_list_enabled = false
+       ipv6_addresses            = (known after apply)
+       ipv6_prefix_count         = (known after apply)
+       ipv6_prefixes             = (known after apply)
+       mac_address               = (known after apply)
+       outpost_arn               = (known after apply)
+       owner_id                  = (known after apply)
+       private_dns_name          = (known after apply)
+       private_ip                = (known after apply)
+       private_ip_list           = (known after apply)
+       private_ip_list_enabled   = false
+       private_ips               = (known after apply)
+       private_ips_count         = (known after apply)
+       security_groups           = (known after apply)
+       source_dest_check         = true
+       subnet_id                 = (known after apply)
+       tags                      = (known after apply)
+       tags_all                  = (known after apply)

+       attachment {
+           attachment_id = (known after apply)
+           device_index  = (known after apply)
+           instance      = (known after apply)
        }
    }

  # module.complete.aws_route.private will be created
+   resource "aws_route" "private" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.complete.aws_route.public will be created
+   resource "aws_route" "public" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.complete.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = (known after apply)
+       tags_all         = (known after apply)
+       vpc_id           = (known after apply)
    }

  # module.complete.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = (known after apply)
+       tags_all         = (known after apply)
+       vpc_id           = (known after apply)
    }

  # module.complete.aws_route_table_association.private will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.complete.aws_route_table_association.public will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.complete.aws_secretsmanager_secret.config_backup_password will be created
+   resource "aws_secretsmanager_secret" "config_backup_password" {
+       arn                            = (known after apply)
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "sophos-fw-backup-configuration-password"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 0
+       rotation_enabled               = (known after apply)
+       rotation_lambda_arn            = (known after apply)
+       tags_all                       = (known after apply)

+       replica {
+           kms_key_id         = (known after apply)
+           last_accessed_date = (known after apply)
+           region             = (known after apply)
+           status             = (known after apply)
+           status_message     = (known after apply)
        }

+       rotation_rules {
+           automatically_after_days = (known after apply)
        }
    }

  # module.complete.aws_secretsmanager_secret.console_password will be created
+   resource "aws_secretsmanager_secret" "console_password" {
+       arn                            = (known after apply)
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "sophos-fw-console-password"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 0
+       rotation_enabled               = (known after apply)
+       rotation_lambda_arn            = (known after apply)
+       tags_all                       = (known after apply)

+       replica {
+           kms_key_id         = (known after apply)
+           last_accessed_date = (known after apply)
+           region             = (known after apply)
+           status             = (known after apply)
+           status_message     = (known after apply)
        }

+       rotation_rules {
+           automatically_after_days = (known after apply)
        }
    }

  # module.complete.aws_secretsmanager_secret.secure_storage_master_key will be created
+   resource "aws_secretsmanager_secret" "secure_storage_master_key" {
+       arn                            = (known after apply)
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "sophos-fw-secure-storage-master-key"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 0
+       rotation_enabled               = (known after apply)
+       rotation_lambda_arn            = (known after apply)
+       tags_all                       = (known after apply)

+       replica {
+           kms_key_id         = (known after apply)
+           last_accessed_date = (known after apply)
+           region             = (known after apply)
+           status             = (known after apply)
+           status_message     = (known after apply)
        }

+       rotation_rules {
+           automatically_after_days = (known after apply)
        }
    }

  # module.complete.aws_secretsmanager_secret_version.config_backup_password will be created
+   resource "aws_secretsmanager_secret_version" "config_backup_password" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # module.complete.aws_secretsmanager_secret_version.console_password will be created
+   resource "aws_secretsmanager_secret_version" "console_password" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # module.complete.aws_secretsmanager_secret_version.secure_storage_master_key will be created
+   resource "aws_secretsmanager_secret_version" "secure_storage_master_key" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # module.complete.aws_security_group.lan[0] will be created
+   resource "aws_security_group" "lan" {
+       arn                    = (known after apply)
+       description            = "Security Group for private subnet. Allow everything by default"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       name                   = "Private Subnet"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "LAN"
        }
+       tags_all               = {
+           "Name" = "LAN"
        }
+       vpc_id                 = (known after apply)
    }

  # module.complete.aws_security_group.public[0] will be created
+   resource "aws_security_group" "public" {
+       arn                    = (known after apply)
+       description            = "Untrusted network restricted from access port 22 and 4444"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow all traffic outbound"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow public access 0 - 21"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 21
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow public access 23 - 4443"
+               from_port        = 23
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 4443
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow public access 4445 - 65535"
+               from_port        = 4445
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
        ]
+       name                   = "Public"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "Public"
        }
+       tags_all               = {
+           "Name" = "Public"
        }
+       vpc_id                 = (known after apply)
    }

  # module.complete.aws_security_group.trusted[0] will be created
+   resource "aws_security_group" "trusted" {
+       arn                    = (known after apply)
+       description            = "Enable TCP access from trusted network"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow all traffic outbound"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "20.242.88.198/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
        ]
+       name                   = "Trusted Network"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "Trusted Network"
        }
+       tags_all               = {
+           "Name" = "Trusted Network"
        }
+       vpc_id                 = (known after apply)
    }

  # module.complete.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = (known after apply)
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = (known after apply)
+       tags_all                                       = (known after apply)
+       vpc_id                                         = (known after apply)
    }

  # module.complete.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = (known after apply)
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.0.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = (known after apply)
+       tags_all                                       = (known after apply)
+       vpc_id                                         = (known after apply)
    }

  # module.complete.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = (known after apply)
+       tags_all                             = (known after apply)
    }

  # module.complete.random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 1
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
+       prefix      = "sophos-xg"
    }

  # module.complete.random_shuffle.az will be created
+   resource "random_shuffle" "az" {
+       id           = (known after apply)
+       input        = [
+           "us-west-2a",
+           "us-west-2b",
+           "us-west-2c",
+           "us-west-2d",
        ]
+       result       = (known after apply)
+       result_count = 1
    }

  # module.key-pair.aws_key_pair.this[0] will be created
+   resource "aws_key_pair" "this" {
+       arn             = (known after apply)
+       fingerprint     = (known after apply)
+       id              = (known after apply)
+       key_name        = "sophos"
+       key_name_prefix = (known after apply)
+       key_pair_id     = (known after apply)
+       key_type        = (known after apply)
+       public_key      = (known after apply)
+       tags_all        = (known after apply)
    }

  # module.key-pair.tls_private_key.this[0] will be created
+   resource "tls_private_key" "this" {
+       algorithm                     = "RSA"
+       ecdsa_curve                   = "P224"
+       id                            = (known after apply)
+       private_key_openssh           = (sensitive value)
+       private_key_pem               = (sensitive value)
+       private_key_pem_pkcs8         = (sensitive value)
+       public_key_fingerprint_md5    = (known after apply)
+       public_key_fingerprint_sha256 = (known after apply)
+       public_key_openssh            = (known after apply)
+       public_key_pem                = (known after apply)
+       rsa_bits                      = 4096
    }

Plan: 29 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"     
```